"use client";

import React from "react";

const ProgramReimbursement = () => {
  return (
    <main className="flex flex-col min-h-screen bg-gray-50">
      <Hero />
      <Content />
    </main>
  );
};

const Hero = () => (
  <section
    id="hero"
    className="relative bg-white text-center py-24 md:py-32 overflow-hidden"
  >
    <div className="max-w-4xl mx-auto px-4 space-y-4">
      <h1 className="text-4xl md:text-6xl font-extrabold tracking-tight text-[#5ca59f]">
        Програма реімбурсації
      </h1>
    </div>
    <div className="absolute bottom-0 left-0 w-full text-[#5ca59f]/20">
      <svg
        aria-hidden="true"
        viewBox="0 0 1440 60"
        xmlns="http://www.w3.org/2000/svg"
        className="w-full h-auto"
      >
        <path
          fill="currentColor"
          d="M0 0h1440v40s-138-20-324-20c-186 0-361 15-554 15C370.2 35 0 60 0 60V0Z"
        />
      </svg>
    </div>
  </section>
);

const Content = () => (
  <section className="flex-1 container mx-auto px-4 py-16 prose lg:prose-lg max-w-4xl text-justify">
    <p>
      <a
        href="https://moz.gov.ua/storage/uploads/0ff673ad-91df-44c8-a25d-6261a8d915ac/dn_440_13032025_dod.pdf"
        className="text-[#5ca59f] underline"
      >
        Перелік медичних виробів, які підлягають реімбурсації за програмою
        державних гарантій медичного обслуговування населення, станом на 26
        лютого 2025 року.
      </a>
    </p>
    <p>
      <a
        href="https://moz.gov.ua/storage/uploads/0ff673ad-91df-44c8-a25d-6261a8d915ac/dn_440_13032025_dod_2.pdf"
        className="text-[#5ca59f] underline"
      >
        Перелік лікарських засобів, які підлягають реімбурсації за програмою
        державних гарантій медичного обслуговування населення, станом на 26
        лютого 2025 року.
      </a>
    </p>
    <strong>
      <h2>
        Програма «Доступні ліки» постійно розширюється і відтепер включає
        препарати для:
      </h2>
    </strong>
    <ul>
      <li>- серцево-судинних хвороб;</li>
      <li>- профілактики інсультів та інфарктів;</li>
      <li>
        - нецукрового діабету та цукрового діабету І типу (інсулін) та діабету
        ІІ типу;
      </li>
      <li>
        - хронічних хвороб нижніх дихальних шляхів; розладів психіки, поведінки,
        а також епілепсії;
      </li>
      <li>- хвороби Паркінсона;</li>
      <li>- серцево-судинних та цереброваскулярних захворювань;</li>
      <li>- болю та надання паліативної допомоги;</li>
      <li>- ендокринної системи;</li>
      <li>- метаболічних, аутоімунних та запальних захворювань;</li>
      <li>- глаукоми;</li>
      <li>- лікування мігрені;</li>
      <li>- лікування захворювань у дітей.</li>
    </ul>
    <div style={{ marginBottom: "1rem" }}></div>
    <div></div>
    <strong>
      <h2>Як отримати безоплатні ліки?</h2>
    </strong>
    <p>Покрокова інструкція:</p>
    <ol>
      <li>
        1. Зверніться до лікаря (терапевта, педіатра або сімейного лікаря), з
        яким укладено декларацію, та отримайте електронний рецепт
      </li>
      <li>2. Завітайте до аптеки з позначкою «Тут є Доступні ліки».</li>
      <li>
        3. Отримайте ліки безоплатно або з частковою доплатою за е-рецептом.
      </li>
      <li>Вартість ліків повністю або частково оплачує держава.</li>
    </ol>
    <div style={{ marginBottom: "1rem" }}></div>
    <strong>
      <h2>Як отримати електронний рецепт на «Доступні ліки»?</h2>{" "}
    </strong>
    <p>
      З 1 квітня 2019 року ліки за програмою реімбурсації «Доступні ліки» можна
      отримати за електронним рецептом, виписаним лікарем через електронну
      систему охорони здоров’я.
    </p>
    <ol>
      <li>
        Крок 1. Пацієнт записується та приходить на прийом до лікаря, з яким у
        нього укладена декларація.
      </li>
      <p>
        <strong>Важливо!</strong> Пацієнт має звернутися саме до свого лікаря.
        Якщо ви ще не підписали декларацію, це варто зробити. Без декларації
        скористатися програмою «Доступні ліки» буде неможливо.
      </p>
      <li>Крок 2. Лікар проводить прийом і виписує е-рецепт.</li>
      <li>
        Крок 3. Під час виписування електронного рецепта лікар разом з пацієнтом
        мають перевірити, чи номер мобільного телефону, зазначений в декларації
        є актуальним і належить пацієнту. Лікар повинен назвати вам код
        мобільного оператора та останні цифри номера. У разі, якщо номер
        телефону не належить пацієнту або у пацієнта змінився номер телефону,
        інформацію про це потрібно оновити. Змінити номер телефону можна через
        електронну форму на сайті НСЗУ у розділі{" "}
        <a
          href="https://nszu.gov.ua/gromadyanam."
          className="text-[#5ca59f] underline"
        >
          «Громадянам»
        </a>
        . Подати запит може як пацієнт самостійно, так і лікар на прохання
        пацієнта.
      </li>
      <li>
        Крок 4. Після перевірки номера телефону лікар виписує е-рецепт в
        електронній системі охорони здоров’я.
      </li>
      <li>
        Крок 5. На мобільний телефон пацієнта приходить СМС з унікальним номером
        рецепта та кодом підтвердження для отримання ліків в аптеці. Зміст СМС:
        «Ваш рецепт: ХХХХ-ХХХХ-ХХХХ-ХХХХ. Код підтвердження: ХХХХ».
      </li>
      <li>
        Крок 6. Пацієнт йде у будь-яку зручну для нього аптеку, що бере участь у
        програмі «Доступні ліки».
      </li>
      <li>
        Крок 7. В аптеці пацієнт повідомляє працівникові аптеки 16-значний номер
        рецепта.
      </li>
      <li>
        Крок 8. Фармацевт пропонує пацієнту наявні лікарські засоби на вибір —
        спочатку безоплатні, а потім з доплатою.
      </li>
      <li>
        Крок 9. Далі пацієнту потрібно переконатись:
        <ul>
          <li>
            - чи є в наявності саме те торгівельне найменування лікарського
            засобу і виробництва, яке бажає отримати пацієнт?
          </li>
          <li>
            - чи кількість лікарського засобу запропонована в повному обсязі?
          </li>
          <li>
            - чи буде доплата за обраний лікарський засіб і в якому розмірі?
          </li>
          <li>- якщо так, чи згоден пацієнт доплачувати таку суму?</li>
        </ul>
        <p>
          <strong>Важливо!</strong> Якщо відповідь на одне або декілька запитань
          наведених вище «ні», то пацієнт не повинен називати або показувати
          фармацевту 4-значний код підтвердження.
        </p>
      </li>
      <li>
        У разі, якщо пацієнта все влаштовує, він називає код підтвердження. Якщо
        необхідно, здійснює доплату, а фармацевтичний працівник накладає
        електронний підпис. Все, рецепт погашено. Після цього пацієнт отримує
        призначені ліки.
      </li>
      <li>
        Крок 10. Якщо в даній аптеці немає саме того лікарського засобу, який
        бажає отримати пацієнт, він не називає код підтвердження рецепта, і має
        змогу звернутися до іншої аптеки. Або замовити той лікарський засіб,
        який відсутній в аптеці у момент звернення пацієнта.
      </li>
    </ol>
    <div style={{ marginBottom: "1rem" }}></div>

    <strong>
      <h2>Де можна отримати ліки?</h2>
    </strong>
    <p>
      Починаючи з липня 2025 року всі субʼєкти господарювання, що здійснюють
      роздрібну торгівлю ліками в аптечних закладах, будуть зобовʼязані укласти
      договір з НСЗУ в межах програми реімбурсації «Доступні ліки». Це означає,
      що отримати ліки безоплатно чи з частковою доплатою за цією програмою
      можна буде в будь-якій аптеці. Раніше в обовʼязковому порядку до програми
      були приєднані лише аптеки, розміщені в лікарнях.
    </p>
    <p>
      Реалізація проекту сприятиме удосконаленню доступу населення до лікарських
      засобів. Постанова набирає чинності з <strong>1 липня 2025 року</strong>,
      щоб усі аптеки встигли укласти договір з НСЗУ та втілити зміни.
    </p>
    <p>
      До цього отримати ліки можна в аптеках з наліпкою «Тут є Доступні ліки».
      Знайти найближчу з договором із НСЗУ можна:
    </p>
    <ul>
      <li>
        {" "}
        - за{" "}
        <a
          href="https://edata.e-health.gov.ua/e-data/dashboard/pharmacy-map"
          className="text-[#5ca59f] underline"
        >
          посиланням
        </a>{" "}
        на сайті НСЗУ;
      </li>
      <li> - у контакт-центрі НСЗУ за номером 16-77.</li>
    </ul>
    <p>
      Ліки можна отримати за е-рецептом без прив'язки до місцевості, де цей
      рецепт був виданий, чи місця проживання пацієнта. Наприклад, якщо
      пацієнтові виписаний е-рецепт в Києві, то отримати ліки за ним можна і в
      Одесі.
    </p>
    <p>
      Скористатись програмою «Доступні ліки» можуть також мешканці тимчасово
      окупованих територій.
    </p>
    <div style={{ marginBottom: "1rem" }}></div>

    <strong>
      <h2>
        Що робити, якщо в аптеці закінчилися безоплатні ліки, або ті, що
        відшкодовуються?
      </h2>
    </strong>
    <ul>
      <li>- Пацієнт може зачекати, поки ліки надійдуть в аптеку.</li>
      <li>- Пацієнт може звернутись в іншу аптеку.</li>
      <li>- Пацієнт може обрати іншу торгову марку та доплатити різницю.</li>
    </ul>
    <div style={{ marginBottom: "1rem" }}></div>
    <strong>
      <h2>
        Які ліки пацієнт може отримати безоплатно, а за які потрібно
        доплачувати?
      </h2>
    </strong>
    <p>
      Держава компенсує вартість найдешевшого лікарського засобу, який подав
      заявку на участь в програмі «Доступні ліки». Також наявність препарату у
      програмі залежить від рішення про його участь від виробника — він має
      подати заявку для включення свого препарату до Реєстру лікарських засобів,
      які підлягають реімбурсації.
    </p>
    <p>
      Реєстр ліків є у вільному доступі на{" "}
      <a
        href="https://contracting.nszu.gov.ua/ogoloshennya-pro-ukladennya-dogovoriv/dostupni-liky"
        className="text-[#5ca59f] underline"
      >
        сайті НСЗУ
      </a>{" "}
      та містить, зокрема, інформацію про тип відшкодування (безоплатно або з
      доплатою із зазначенням розміру доплати). Існує міф, що у програмі
      «Доступні ліки» беруть лише найдешевші препарати вітчизняних виробників.
      Це не правда. Всі лікарські засоби, які беруть участь в програмі
      зареєстровані в Україні та пройшли необхідні процедури експертизи перед їх
      державною реєстрацією. В Реєстрі містяться препарати, як і вітчизняного,
      так і іноземного виробництва. Нагадуємо, що участь в програмі з боку
      фармацевтичних виробників є добровільною. Виробник самостійно подає заяву
      до Національної служби здоров’я України для включення лікарського засобу
      власного виробництва до Реєстру реімбурсації.
    </p>
  </section>
);

export default ProgramReimbursement;
